In [1]:
import numpy as np  #multidim array operation
import pandas as pd #data set : analysis (esp csv file)
import matplotlib.pyplot as plt #data visualisation
#pyplot is a file

In [2]:
pwd #location

'C:\\Users\\DELL\\linear-regression'

In [3]:
ds=pd.read_csv("Salary_Data.csv") #same location, then name is enough
#comma seperated values

In [4]:
ds.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [9]:
#creating a df from list of list
a=[[2,3,4],[1,2,3]]
df1=pd.DataFrame(a,index=["ra","sa"],columns=["ma","pi","ch"])
df1

    ma  pi  ch
ra   2   3   4
sa   1   2   3

In [12]:
#creating a df from dict
d={"hari":[12,14,16],"krishna":[13,15,17]}
df2=pd.DataFrame(d)
df2

   hari  krishna
0    12       13
1    14       15
2    16       17

In [19]:
print(df2['hari'][1])
print(df2.iloc[1][0])
#iloc : even if there is a custom indexing, we can access through index with help of iloc

14
14

In [20]:
x=ds.iloc[:,:-1].values #starting to -1-1 =-2
# .values is to avoid index values
#output comes as an array (2D)
#to check dim : .ndim 
#x : year of exp
#y : salary
y=ds.iloc[:,-1].values

In [21]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=1)
#random state=1